const shynessScaleQuestionData = [
  {
    question: "اناشخص خجول",
    options: ["موافق بشدة", "موافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
  },
  {
    question: "اناشخص هادئ",
    options: ["موافق بشدة", "موافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
  },
  {
    question: "عادة ما أاحدث عند مجموعات صغيرة 6-3 أشخاص",
    options: ["موافق بشدة", "موافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
  },
  {
    question: "معظم الأشخاص يتحدثون اكثر مما أفعل",
    options: ["موافق بشدة", "موافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
  },
  {
    question: "أتحدث في الفصل أكثر مما يفعل الأخرون",
    options: ["موافق بشدة", "موافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
  },
  {
    question: "في الغالب الناس عادة أكثر خجلا مني ",
    options: ["موافق بشدة", "موافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
  },
];
export default shynessScaleQuestionData;
