const shynessScaleQuestionData = [
  {
    id: 1,
    question: "اناشخص خجول",
    options: ["موافق بشدة", "موافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
  },
  {
    id: 2,
    question: "الآخرون يعتقدون أنني أتحدث كثيراً",
    options: ["موافق بشدة", "موافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
  },
  {
    id: 3,
    question: "أنا شخص كثير الكلام",
    options: ["موافق بشدة", "موافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
  },
  {
    id: 4,
    question: "الآخرون يعتقدون أنني شخص خجول",
    options: ["موافق بشدة", "موافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
  },
  {
    id: 5,
    question: "عادة ما أتحدث كثيراً",
    options: ["موافق بشدة", "موافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
  },
  {
    id: 6,
    question: "عادة ما أكون شخص هادئ في الفصل الدراسي",
    options: ["موافق بشدة", "موافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
  },
  {
    id: 7,
    question: "لا أتحدث كثيراً",
    options: ["موافق بشدة", "موافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
  },
  {
    id: 8,
    question: "أتحدث عادة أكثر من الآخرين",
    options: ["موافق بشدة", "موافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
  },
  {
    id: 9,
    question: "أنا شخص هادئ",
    options: ["موافق بشدة", "موافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
  },

  {
    id: 10,
    question: "عادة ما أاحدث عند مجموعات صغيرة 6-3 أشخاص",
    options: ["موافق بشدة", "موافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
  },
  {
    id: 11,
    question: "معظم الأشخاص يتحدثون اكثر مما أفعل",
    options: ["موافق بشدة", "موافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
  },
  {
    id: 12,
    question: "أتحدث في الفصل أكثر مما يفعل الأخرون",
    options: ["موافق بشدة", "موافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
  },
  {
    id: 13,
    question: "في الغالب الناس عادة أكثر خجلا مني ",
    options: ["موافق بشدة", "موافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
  },
];
export default shynessScaleQuestionData;
